test/simpleTest2D/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pOut            1e5;

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pOut;

boundaryField
{
    outlet
    {
        type            fixedValue;
        value   uniform $pOut;
    }

    "electrod.*"
    {
        type            zeroGradient;
    }

    "(front|back)"
    {
        type            empty;
    }

    axis
    {
        type symmetry;
    }

    //#includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
