test/simpleTest2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

domain
{
    //dimensions
    Rin     1;
    Rout    10;
    Dbot    -2;
    Dup     2;
    Hbot    -5;
    Hup     5;

    width   0.01;

    // Number of cells
    RinCells  10; 
    DCells    30;
    HCells    20; 
    RoutCells 40; 
    
    // Mesh grading
    zGrading    7000;  // aerofoil to far field
    xUGrading   5;   // towards centre upstream
    leadGrading 0.2; // towards leading edge
    xDGrading   150;  // downstream
}


vertices
(
    (0 0 $:domain.Dbot)
    ($:domain.Rin 0 $:domain.Dbot)
    ($:domain.Rin 0 $:domain.Dup)
    (0 0 $:domain.Dup)
    
    (0 $:domain.width $:domain.Dbot)
    ($:domain.Rin $:domain.width $:domain.Dbot)
    ($:domain.Rin $:domain.width $:domain.Dup)
    (0 $:domain.width $:domain.Dup)

    ($:domain.Rin 0 $:domain.Hbot)
    ($:domain.Rout 0 $:domain.Hbot)
    ($:domain.Rout 0 $:domain.Hup)
    ($:domain.Rin 0 $:domain.Hup)
  
    ($:domain.Rin $:domain.width $:domain.Hbot)
    ($:domain.Rout $:domain.width $:domain.Hbot)
    ($:domain.Rout $:domain.width $:domain.Hup)
    ($:domain.Rin $:domain.width $:domain.Hup)

    ($:domain.Rout 0 $:domain.Dbot)
    ($:domain.Rout $:domain.width $:domain.Dbot)

    ($:domain.Rout 0 $:domain.Dup)
    ($:domain.Rout $:domain.width $:domain.Dup)
);

blocks
(
    hex (0 1 5 4 3 2 6 7)
    ($:domain.RinCells 1 $:domain.DCells)
    simpleGrading (1 1 1)
   
    hex (8 9 13 12 1 16 17 5)
    ($:domain.RoutCells 1 $:domain.HCells)
    simpleGrading (1 1 1)

    hex (1 16 17 5 2 18 19 6)
    ($:domain.RoutCells 1 $:domain.DCells)
    simpleGrading (1 1 1)

    hex (2 18 19 6 11 10 14 15)
    ($:domain.RoutCells 1 $:domain.HCells)
    simpleGrading (1 1 1)
);


edges
(
);


boundary
(
    axis
    {
        type symmetry;
        faces
        (
            (3 7 4 0)
        );    
    }

    electrodFaceBot
    {
        type wall;
        faces
        (
            (4 5 1 0)
        );
    }

    electrodFaceTop
    {
        type wall;
        faces
        (
            (3 2 6 7)
        );
    }

    electrodSides
    {
        type wall;
        faces
        (
            (11 15 6 2)
            (1 5 8 12)
    
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (11 10 14 15)
            (14 10 18 19)
            (18 19 17 16)
            (16 17 13 9)
            (12 13 9 8)
        );
    }

    front
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (8 9 16 1)
            (1 16 18 2)
            (2 18 10 11)
        );
    }

    back
    {
        type empty;
        faces
        (
            (7 6 5 4)
            (5 17 13 12)
            (6 19 17 5)
            (15 14 19 6)
        );
    }

);

// ************************************************************************* //
